
/*  @file               nfn0000.pc
*   @file_type          c source program
*   @brief              국고 한국은행 취급요청  main
*   @warn
*   @author
*   @version 
*   @dep_haeder
*   @dep_module
*   @dep_table
*   @dep_infile
*   @dep_outfile
*   @library
*   @usage
*
*
*
*
*
*
*
*
*
*
*
*   @generated at 2023/06/02 09:30
*   @history
*
*   성   명 :   일   자    근거자료         변경             내용   
*  ---------------------------------------------------------------------------------------------------------------
* 
*/
#include <syscom.h>
#include <sysconst.h>
#include <utodate.h>
#include <exdefine.h>
#include <exmsg1500.h>
#include <nfi0002f.h>
#include <nfi3100f.h>
#include <nflog.h>
#include <sqlca.h>
#include <hcmihead.h>

/* ---------------------------------------- constant, macro definitions --------------------------------------- */
#define EXMSG1500           (ctx->exmsg1500)
#define EXMSG1500DETL       (ctx->exmsg1500->detl_area)
/* ---------------------------------------- structure definitions --------------------------------------------- */
typedef struct nfn0000_ctx_s    nfn0000_ctx_t;
struct nfn0000_ctx_s {
    commbuff        *cb;  

    exmsg1500_t     _exmsg1500;
    exmsg1500_t     *exmsg1500;

    int             recv_len;                           /* 수신 길이 */
    int             send_len;                           /* 대외기관 전송길이    */
    char            msg_no   [LEN_NFI0002F_MSG_NO  + 1];
    char            corr_id  [LEN_NFI0002F_CORR_ID + 1];
    char            kti_flag;  /* KTI Flag 1:KTI 0:core    */


};

/* ------------------------------------- exported global variables definitions -------------------------------- */
/* ------------------------------------------ exported function  declarations --------------------------------- */
static int  a000_data_receive(nfn0000_ctx_t *ctx, commbuff_t    *commbuff);
static int  b000_init_proc(nfn0000_ctx_t *ctx, int log_type);
static int  c000_instsq_update(nfn0000_ctx_t *ctx);
static int  d000_jrn_insert(nfn0000_ctx_t *ctx);
static int  m000_ext_msg_send(nfn0000_ctx_t *ctx);
static int  z000_error_proc(nfn0000_ctx_t *ctx);
static int  z100_log_insert(nfn0000_ctx_t *ctx,  char *log_data, int size, char io_flag, char sr_flag);
/* ------------------------------------------------------------------------------------------------------------ */

/* ------------------------------------------------------------------------------------------------------------ */

/* ------------------------------------------------------------------------------------------------------------ */
/* ------------------------------------------------------------------------------------------------------------ */
/* ------------------------------------------------------------------------------------------------------------ */
/* ------------------------------------------------------------------------------------------------------------ */
/* ------------------------------------------------------------------------------------------------------------ */
/* ------------------------------------------------------------------------------------------------------------ */
/* ------------------------------------------------------------------------------------------------------------ */
/* ------------------------------------------------------------------------------------------------------------ */
/* ------------------------------------------------------------------------------------------------------------ */
